Revit 2027 API
InternalDefinition.GetTypeId Method
 Gets the identifier of the parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId GetTypeId()
Public Function GetTypeId As ForgeTypeId
public:
ForgeTypeId^ GetTypeId()
member GetTypeId : unit -> ForgeTypeId
Return Value
ForgeTypeId
See Also
Reference
InternalDefinition Class
Autodesk.Revit.DB Namespace